# Exercise 1 - Array creation and Reshaping

In [18]:
import numpy as np

arr1 = np.arange(1, 11)

print('created array of 1 to 10 is :' ,arr1)

reshape_arr2 = arr1.reshape(2, 5,)

print('reshaped array :' ,reshape_arr2)

created array of 1 to 10 is : [ 1  2  3  4  5  6  7  8  9 10]
reshaped array : [[ 1  2  3  4  5]
 [ 6  7  8  9 10]]

# Exercise 2 - Element extraction

In [24]:
arr2 = np.arange(1, 21)
print('Orginal array is :' ,arr2)
extracted_elements = arr2[5:15]

print('The required elements are:' ,extracted_elements)

Orginal array is : [ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]
The required elements are: [ 6  7  8  9 10 11 12 13 14 15]

# Exercise 3 - Panda Series

In [32]:
import pandas as pd

fruits_series = pd.Series([3,2,1],index=['apples', 'bananas', 'oranges'])

fruits_series['pears'] = 4

print(fruits_series)

apples     3
bananas    2
oranges    1
pears      4
dtype: int64

# Exercise 4 - DataFrame

In [42]:
df1 = pd.DataFrame([['Virat Kohli', 35, 'Male'],['MS Dhoni', 42, 'Male'],['Sachin Tendulkar', 50, 'Male'],['Smriti Mandhana', 27, 'Female'],['Meg Lanning', 32, 'Female'],
                    ['Shafali Verma', 20, 'Female'],['Jasprit Bumrah', 30, 'Male'],['Kane Williamson', 33, 'Male'],['Beth Mooney', 30, 'Female'],['Alyssa Healy', 34, 'Female']],
                   columns=['Name','Age','Gender'])
df1

               Name  Age  Gender
0       Virat Kohli   35    Male
1          MS Dhoni   42    Male
2  Sachin Tendulkar   50    Male
3   Smriti Mandhana   27  Female
4       Meg Lanning   32  Female
5     Shafali Verma   20  Female
6    Jasprit Bumrah   30    Male
7   Kane Williamson   33    Male
8       Beth Mooney   30  Female
9      Alyssa Healy   34  Female

# Exercise 5 - Adding Column to DataFrame

In [44]:
df1['Occupation']=['Programmer', 'Manager','Analyst','Programmer', 'Manager','Analyst','Programmer', 'Manager','Analyst','Manager']
df1

               Name  Age  Gender  Occupation
0       Virat Kohli   35    Male  Programmer
1          MS Dhoni   42    Male     Manager
2  Sachin Tendulkar   50    Male     Analyst
3   Smriti Mandhana   27  Female  Programmer
4       Meg Lanning   32  Female     Manager
5     Shafali Verma   20  Female     Analyst
6    Jasprit Bumrah   30    Male  Programmer
7   Kane Williamson   33    Male     Manager
8       Beth Mooney   30  Female     Analyst
9      Alyssa Healy   34  Female     Manager

# Exercise 6 - Age Filter in DataFrame

In [48]:
df2_age = df1[df1['Age'] >= 30]
df2_age

               Name  Age  Gender  Occupation
0       Virat Kohli   35    Male  Programmer
1          MS Dhoni   42    Male     Manager
2  Sachin Tendulkar   50    Male     Analyst
4       Meg Lanning   32  Female     Manager
6    Jasprit Bumrah   30    Male  Programmer
7   Kane Williamson   33    Male     Manager
8       Beth Mooney   30  Female     Analyst
9      Alyssa Healy   34  Female     Manager

# Exercise 7 - DataFrame --> CSV --> Read & Display

In [54]:
df1.to_csv('dataframe.csv', index=False)

df_read = pd.read_csv('dataframe.csv')

print(df_read)

               Name  Age  Gender  Occupation
0       Virat Kohli   35    Male  Programmer
1          MS Dhoni   42    Male     Manager
2  Sachin Tendulkar   50    Male     Analyst
3   Smriti Mandhana   27  Female  Programmer
4       Meg Lanning   32  Female     Manager
5     Shafali Verma   20  Female     Analyst
6    Jasprit Bumrah   30    Male  Programmer
7   Kane Williamson   33    Male     Manager
8       Beth Mooney   30  Female     Analyst
9      Alyssa Healy   34  Female     Manager